#include <iostream>

int main()
{
    using std::cout;
    using std::cin;
    int n;
    cout<< "Введите n (от 1 до 7)\n";
    cin>> n;
   
    cout<<"Введите k (от 1 до 99)\n";
    int k,s;
    s = n;
    cin>>k;
    if ((n > 7) || (n < 1) || (k<1) || (k>99))//Проверяем чтобы значения были введены согласно условию
    {
        cout<<"Значения введены неверно (n от 1 до 7),(k от 1 до 99)\n";
        return -1;
    }
    cout<<"ПН ВТ СР ЧТ ПТ СБ ВС\n";
    for (int i=1;i < n;i +=1 ) //Ставим пробелы до нужного дня недели
    {
        cout<<"   ";
    }
    
    for (int i=1;i <= k; i +=1) //Вывод чисел
    {
        if ((s % 7 == 0) && (s !=0)) //После каждого 7 числа начинаем новую строку
        {
        
            
            
            if (i < 10) //Если число меньше 10 то ставим дополнительный пробел перед числом
            {
                cout<<" "<<"\033[31m"<<i<<"\033[0m"<<" "; 
            }
            else 
            {
                cout<<"\033[31m"<<i<<"\033[0m"<<" "; 
            } 
    cout<<"\n";
    s = 0;
    
    }
    
      else if (i < 10) //Если число меньше 10 то ставим дополнительный пробел перед числом
            {
                cout<<" "<<i<<" "; 
            }
            else 
            {
                cout<< i<<" ";
            } 
        
        s += 1;
        
    }

    cout<<"\n";
    
    return 0;
}